## TITANIC DATASET 
- go through KAGGLE for domain knowledge, more in-depth understanding on EDA and to understand feature engineering.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
titanic = pd.read_csv('titanic.csv', index_col = 0)
titanic

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
titanic[titanic['Fare'] == 0]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S
482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S
733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S
807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

## Assumption: Either data is missing or THEY COULD BE CREW MEMBERS
### TO SUPPORT MY ASSUMPTION I WILL HAVE TO MAKE SOME MORE OBSERVATIONS SO THAT I CAN INCREASE THE POSSIBILITY OF THEM BEING CREW MEMBERs:

**DATA I CAN GATHER TO SUPPORT MY ASSUMPTION:**
- We observe the 'Embarked' column to see they all boarded from SouthHampton (S) and we can serch on google to find out that Titanic started its sail from that port. Crew members would obviously board the ship from the starting location therefore it is a supporting argument for our assumption.
- Another supporting argument/data is that family members on the ship are zero for these people- 'Parch' and 'SibSp' columns. This is ideal for them to be crew members.
- All of them are male(in 1912- women were probably not allowed to be a cre member on ships) and most are middle aged(from what data we have).
- Except for one, no one else survived. In such a disaster, preference would have been given to survival of passengers and therefore it supports our assumption.

ALL THESE POINTS ARE NOT ENOUGH TO MAKE AN ACCURATE DECLARATION ABOUT OUR ASSUMPTION BUT THERE ARE NOT ANY UNFAVOURABLE ARGUMENTS THAT WE CAN SEE HERE SO IN CASE OF EDA ON PASSENGERS WE CAN DROP THESE COLUMNS IF WE WANT TO. IT IS PART OF **DATA CLEANING.**

In [19]:
len(titanic[titanic['Sex'] == 'male'])

577

In [4]:
len(titanic[titanic['Sex'] == 'male'])/len(titanic)
#finding out the decimal percentage/ fraction of males in the dataset
#nearly 65% were male. Similarly you can find the number for females.

0.6475869809203143

In [20]:
len(titanic[titanic['Sex'] == 'female'])

314

In [6]:
len(titanic[titanic['Sex'] == 'female'])/len(titanic)

0.35241301907968575

In [89]:
#NOW IF WE WANT TO KNOW THE SURVIVAL RATE/CHANCES BASED ON GENDER
len(titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)])

109

In [12]:
#fraction of males survived compared to total passengers
len(titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)])/len(titanic)

0.122334455667789

In [18]:
#fraction of males survived compared to total MALE passengers
len(titanic[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)])/len(titanic[titanic.Sex == 'male'])

0.18890814558058924

In [90]:
len(titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1)])

233

In [14]:
#fraction of females survived compared to total passengers
len(titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1)])/len(titanic)

0.2615039281705948

In [16]:
#fraction of females survived compared to total FEMALE passengers
len(titanic[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1)])/len(titanic[titanic['Sex'] == 'female'])

0.7420382165605095

## WHY DOES PERCENTAGE GIVE US BETTER INFORMATION/UNDERSTANDING?
- BECAUSE DATASET IS IMBALANCED.
- THERE ARE MORE MALE PASSENGERS THAN FEMALES THEREFORE DATA SET IS BIASED AGAINST 'FEMALES' AND BIASED FOR 'MALES' IN THIS CASE WHEN WE TAK ABOUT FREQUENCY FOR THOSE TWO CATEGORIES.
- BUT WHAT INFORMATION PERCENTAGE GIVES US HERE IS THAT EVEN THOUGH THE NUMBER OF FEMALE PASSENGERS IS SIGNIFICANTLY LESS THAN THE NUMBER OF MALE PASSENGERS, THEIR CHANCES/ RATE OF SURVIVAL IS MUCH HIGHER THAN MALE PASSENGERS.

### Simply observing data:

In [5]:
titanic[titanic['Sex'] == 'female']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [21]:
titanic[6:14]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S

In [22]:
titanic.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [23]:
titanic.tail(30)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
862,0,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
871,0,3,"Balkic, Mr. Cerin",male,26.0,0,0,349248,7.8958,NaN,S
872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
titanic.sample(8)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
774,0,3,"Elias, Mr. Dibo",male,NaN,0,0,2674,7.2250,NaN,C
784,0,3,"Johnston, Mr. Andrew G",male,NaN,1,2,W./C. 6607,23.4500,NaN,S
346,1,2,"Brown, Miss. Amelia ""Mildred""",female,24.0,0,0,248733,13.0000,F33,S
70,0,3,"Kink, Mr. Vincenz",male,26.0,2,0,315151,8.6625,NaN,S
395,1,3,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.0,0,2,PP 9549,16.7000,G6,S
24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
586,1,1,"Taussig, Miss. Ruth",female,18.0,0,2,110413,79.6500,E68,S
818,0,2,"Mallet, Mr. Albert",male,31.0,1,1,S.C./PARIS 2079,37.0042,NaN,C

In [27]:
titanic.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [38]:
titanic.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

### fractional weightage of each port of embarkment:

In [43]:
titanic['Embarked'].notnull().sum()

889

In [40]:
len(titanic[titanic['Embarked'] == 'S'])

644

In [41]:
len(titanic[titanic['Embarked'] == 'C'])

168

In [42]:
len(titanic[titanic['Embarked'] == 'Q'])

77

In [44]:
len(titanic[titanic['Embarked'] == 'Q'])/titanic['Embarked'].notnull().sum()

0.08661417322834646

In [45]:
len(titanic[titanic['Embarked'] == 'C'])/titanic['Embarked'].notnull().sum()

0.1889763779527559

In [46]:
len(titanic[titanic['Embarked'] == 'S'])/titanic['Embarked'].notnull().sum()

0.7244094488188977

### fractional weightage of each Pclass:

In [47]:
print(len(titanic[titanic['Pclass'] == 1]))
print(len(titanic[titanic['Pclass'] == 1])/len(titanic))

216
0.24242424242424243

In [48]:
print(len(titanic[titanic['Pclass'] == 2]))
print(len(titanic[titanic['Pclass'] == 2])/len(titanic))

184
0.20650953984287318

In [49]:
print(len(titanic[titanic['Pclass'] == 3]))
print(len(titanic[titanic['Pclass'] == 3])/len(titanic))

491
0.5510662177328844

## ALL OF THESE DONE ABOVE ARE UNIVARIATE ANALYSIS BECAUSE WE ARE ONLY ANALYSING A SINGLE VARIABLE AT A TIME.

## MOVING ONTO BIVARIATE ANALYSIS:

In [52]:
#FINDING OUT HOW MANY PEOPLE SURVIVED WHO EMBARKED FROM SOUTHAMPTON
len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1)])

217

In [53]:
#fractional weightage of people who survived who boarded from Southampton
#COMPARED TO TOTAL PASSENGERS WHO BOARDED FROM S
len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1)])/len(titanic[titanic.Embarked == 'S'])

0.33695652173913043

In [54]:
#fractional weightage of people who survived who boarded from Southampton
#COMPARED TO TOTAL PASSENGERS.
len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1)])/titanic['Embarked'].notnull().sum()

0.2440944881889764

In [55]:
#FINDING OUT HOW MANY PEOPLE SURVIVED WHO EMBARKED FROM CHERBOURG
len(titanic[(titanic['Embarked'] == 'C') & (titanic['Survived'] == 1)])

93

In [56]:
#fractional weightage of people who survived who boarded from Cherbourg
#COMPARED TO TOTAL PASSENGERS WHO BOARDED FROM C
len(titanic[(titanic['Embarked'] == 'C') & (titanic['Survived'] == 1)])/len(titanic[titanic.Embarked == 'C'])

0.5535714285714286

In [57]:
#fractional weightage of people who survived who boarded from Cherbourg
#COMPARED TO TOTAL PASSENGERS.
len(titanic[(titanic['Embarked'] == 'C') & (titanic['Survived'] == 1)])/titanic['Embarked'].notnull().sum()

0.1046119235095613

In [58]:
#FINDING OUT HOW MANY PEOPLE SURVIVED WHO EMBARKED FROM QUEENSTOWN
len(titanic[(titanic['Embarked'] == 'Q') & (titanic['Survived'] == 1)])

30

In [59]:
#fractional weightage of people who survived who boarded from Queenstown
#COMPARED TO TOTAL PASSENGERS WHO BOARDED FROM Q
len(titanic[(titanic['Embarked'] == 'Q') & (titanic['Survived'] == 1)])/len(titanic[titanic.Embarked == 'Q'])

0.38961038961038963

In [60]:
#fractional weightage of people who survived who boarded from Queenstown
#COMPARED TO TOTAL PASSENGERS.
len(titanic[(titanic['Embarked'] == 'Q') & (titanic['Survived'] == 1)])/titanic['Embarked'].notnull().sum()

0.03374578177727784

## MULTIVARIATE ANALYSIS

### 3 variable analysis:
- Embarked, Sex, Survived

In [67]:
#FINDING OUT HOW MANY 'FEMALES' 'SURVIVED' WHO EMBARKED FROM 'SOUTHAMPTON'
print(len(titanic[(titanic['Embarked'] == 'S') &(titanic['Sex'] == 'female')]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female')]))

203
140

In [68]:
#FINDING OUT HOW MANY 'MALES' 'SURVIVED' WHO EMBARKED FROM 'SOUTHAMPTON'
print(len(titanic[(titanic['Embarked'] == 'S') &(titanic['Sex'] == 'male')]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]))

441
77

In [70]:
#FINDING OUT HOW MANY 'FEMALES' 'SURVIVED' WHO EMBARKED FROM 'CHERBOURG'
print(len(titanic[(titanic['Embarked'] == 'C') &(titanic['Sex'] == 'female')]))
print(len(titanic[(titanic['Embarked'] == 'C') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female')]))

73
64

In [71]:
#FINDING OUT HOW MANY 'MALES' 'SURVIVED' WHO EMBARKED FROM 'CHERBOURG'
print(len(titanic[(titanic['Embarked'] == 'C') &(titanic['Sex'] == 'male')]))
print(len(titanic[(titanic['Embarked'] == 'C') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]))

95
29

In [72]:
#FINDING OUT HOW MANY 'FEMALES' 'SURVIVED' WHO EMBARKED FROM 'QUEENSTOWN'
print(len(titanic[(titanic['Embarked'] == 'Q') &(titanic['Sex'] == 'female')]))
print(len(titanic[(titanic['Embarked'] == 'Q') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female')]))

36
27

In [73]:
#FINDING OUT HOW MANY 'MALES' 'SURVIVED' WHO EMBARKED FROM 'CHERBOURG'
print(len(titanic[(titanic['Embarked'] == 'Q') &(titanic['Sex'] == 'male')]))
print(len(titanic[(titanic['Embarked'] == 'Q') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male')]))

41
3

### 4 variable analysis:
- Embarked, Survived, Sex, Pclass

In [81]:
#TOTAL NO. OF FEMALES WHO EMBARKED FROM SOUTHAMPTON WITH 1ST PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 1)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 1)]))

48
46

In [83]:
#TOTAL NO. OF FEMALES WHO EMBARKED FROM SOUTHAMPTON WITH 2ND PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 2)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 2)]))

67
61

In [82]:
#TOTAL NO. OF FEMALES WHO EMBARKED FROM SOUTHAMPTON WITH 3RD PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 3)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 3)]))

88
33

In [84]:
#TOTAL NO. OF MALES WHO EMBARKED FROM SOUTHAMPTON WITH 1ST PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 1)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 1)]))

79
28

In [85]:
#TOTAL NO. OF MALES WHO EMBARKED FROM SOUTHAMPTON WITH 2ND PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 2)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 2)]))

97
15

In [86]:
#TOTAL NO. OF MALES WHO EMBARKED FROM SOUTHAMPTON WITH 3RD PCLASS TICKETS AND NO. OF THEM WHO SURVIVED
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 3)]))
print(len(titanic[(titanic['Embarked'] == 'S') & (titanic['Survived'] == 1) & (titanic['Sex'] == 'male') & (titanic['Pclass'] == 3)]))

265
34

**similarly you can do this for cherbourg and queenstown**

In [91]:
titanic.Fare.median()

14.4542

In [92]:
titanic.Fare.mean()
# the difference b/w mean and median is significant. Why?
# because there is a huge diff b/w amount paid by upper and middle &lower 
#class people.

32.204207968574636

Steps:
- Univariate analysis of all columns
- Handling missing data 
 
      --> drop unnecessary data
      --> bivariate analysis to impute relevant data wherever missing
- Multivariate analysis: followed by Data Visualization in detail.